{
  "@context": "https://schema.org",
  "@type": "Article",
  "@id": "https://aerolith-foundation.github.io/aerolith-content/aerolith-rules.json",
  "inLanguage": "en-US",
  "headline": "Aerolith – Official Rules and Match Formats",
  "description": "Comprehensive presentation of Aerolith practice regulations, gate scoring logic, officiating standards, and recognized competition variants maintained by the Aerolith Foundation.",
  "keywords": [
    "rules",
    "scoring",
    "practice formats",
    "competition",
    "officiating",
    "vertical discipline"
  ],
  "about": "Aerolith is a semi-vertical precision discipline built around ultralight perforated aeroliths, a carbon ring-propulsor, and multi-level vertical scoring gates.",
  "articleSection": "Rules",
  "datePublished": "2025-11-21",
  "dateModified": "2025-11-21",
  "author": {
    "@type": "Organization",
    "name": "Aerolith Foundation"
  },
  "publisher": {
    "@type": "Organization",
    "name": "Aerolith Foundation"
  },
  "articleBody": "I. Vertical Stage Architecture\n\nSanctioned Aerolith practice follows a three-circuit format unless specified in an approved variant. Each circuit spans twelve regulation minutes with a two-minute recalibration interval, allowing athletes to rehydrate, adjust propulsor grip texture, and document gate response data. Within a circuit, each athlete receives four elevation sequences per rotation, and each sequence comprises three attempts. The first attempt establishes tempo, the second qualifies for precision multipliers, and the third must deliver elevated kinetic load to qualify for chain bonuses. Athletes may reserve unused attempts only when the Vertical Chamber steward declares a safety interruption. Regulation time pauses during official reviews, equipment inspections, or environmental recalibrations triggered by airflow variance beyond two percent of baseline. Practice concludes when all circuits complete and cumulative points, including bonuses and penalties, are verified by both scoring consoles.\n\nAerolith emphasizes composure under sustained vertical demand, so warm-up launches are capped at six per athlete and must conclude ten minutes before introductions. Captains submit their launch order to the head official and cannot alter it mid-circuit without invoking an emergency substitution, which carries a five-point deduction to deter strategic churn. The official record includes launch timestamps, gate identifier codes, and spin-rate telemetry supplied by Vertical Chamber sensors. Tie situations advance to a sudden-radiant playoff: athletes perform two mirrored sequences on adjacent gate stacks, and the higher aggregate precision differential secures the practice.\n\nTimeout strategy contributes significantly to Aerolith pacing. Each team controls two sixty-second timeouts per practice, but a timeout may commence only after the Vertical Chamber steward confirms that no aerolith is airborne. Coaches typically use the first timeout to reset psychological rhythm, dimming auxiliary lights and restoring grip rosin. The second timeout, often held for the final circuit, enables analysts to brief athletes on shifting airflow strata revealed by telemetry. Excessive timeout requests or overlapping calls with the opponent result in forfeiture and the assessment of a delay penalty.\n\nII. Field Layout and Vertical Levels\n\nThe standard Aerolith Vertical Chamber occupies a minimum internal volume of 2,400 cubic meters arranged across three breathable levels. The launching zone is a carbon-inlaid ellipse measuring 4.2 meters on the major axis and 2.6 meters on the minor axis, bordered by a copper conduction braid that grounds static charge from repeated propulsor swings. Two tactile ridges bisect the zone, guiding the lead foot placement for left- and right-handed athletes. Overhead clearance must reach at least 9.5 meters to accommodate Ascend gates and kinetic capture nets. Each vertical level hosts a gate column comprising Standard, Precision, Ascend, Kinetic, and Chain modules mounted on tensioned rails. Distances between gate faces are documented in the Vertical Chamber manifest and cannot deviate more than 15 millimeters once certified.\n\nHall designers fine-tune airflow by combining laminar vents near the base level and controllable extraction near the crown. Environmental automation maintains temperature between 18 and 23 degrees Celsius, and humidity between 32 and 45 percent to preserve aerolith responsiveness. Lighting arrays employ indirect sources to avoid glare on the propulsor ring; however, each gate carries its own color-coded halo communicating status: azure for Standard, white for Precision, amber for Ascend, magenta for Kinetic, and emerald for Chain sequences. Launching ellipses are flanked by analysis decks where teams monitor telemetry feeds, but these decks sit behind low baffles to prevent accidental interference with the athlete's field of motion.\n\nPerimeter walkways run along elevation levels two and three, granting officials and maintenance staff access to gate mounting points. These walkways incorporate vibration-damping pads so that footsteps do not disturb suspended modules. The floor beneath the launching ellipse is hollow-core composite with embedded accelerometers; data from these sensors alerts stewards to micro shifts that might compromise footing. Safety netting traces the arc behind Chain gates to intercept aeroliths that overshoot during kinetic surges, while clear sightlines ensure spectators can follow every vertical transition without craning.\n\nIII. Scoring System and Bonus Conditions\n\nAerolith scoring is cumulative across circuits and rewards both accuracy and kinetic narrative. Standard gates carry a base value of 12 points, Precision gates award 18 points, Ascend gates yield 24 points when cleared on a rising path, Kinetic gates vary between 14 and 20 points depending on spin rate, and Chain gates grant 30 points but only when activated at the end of a three-gate sequence. Completing Standard-Precision-Chain in order triggers the Foundation's legacy bonus worth an additional 10 points. Multipliers apply according to shot classification: a clean center pass earns a 1.25 multiplier, edge brush deductions reduce the base value by 15 percent, and dual-plane launches that traverse two vertical levels on a single attempt add a 0.2 efficiency bonus.\n\nPenalties address both technical and behavioral deviations. Foot faults, defined as contact with the copper braid during release, subtract five points and nullify gate bonuses for that attempt. Over-rotation, measured when wrist telemetry exceeds the allowable torque band by more than eight percent, results in a warning; a second offense within the circuit removes the athlete's next attempt. Delay of practice infractions occur if an athlete exceeds the forty-five second launch window, costing two points each time. Safety stoppages initiated by an athlete for tactical gain carry a ten-point deduction unless the head official confirms equipment compromise.\n\nTo preserve strategic diversity, the rulebook includes situational bonuses. Momentum bonuses reward athletes who clear five unique gates within a single circuit, adding eight points. Harmony bonuses grant five points when both athletes on a team complete mirrored Precision launches within a thirty-second span, emphasizing coordinated pacing. Night formats introduce luminescent trails on aeroliths; in these practicees, successful Chain completions under low-light protocols receive an extra 0.15 multiplier to acknowledge heightened difficulty.\n\nEach gate category is defined by both geometry and behavior. Standard gates measure 0.85 meters in diameter and sit flush with the plane of their mounting ring; Precision gates shrink to 0.62 meters and include an inner photometric ring that senses even subtle deviations. Ascend gates tilt forward by three degrees and incorporate adjustable fins that reward upward thrust when the aerolith enters from a lower origin. Kinetic gates feature articulated rims that read spin direction through embedded gyros, awarding higher values for counter-rotational launches. Chain gates consist of three concentric rings: a sensor gate, a capture gate, and a release gate that unlocks only when the preprogrammed sequence requirement is met. Understanding the micro differences among these modules informs how athletes choreograph their attempts.\n\nIV. Officials and Arbitration\n\nEvery Aerolith practice requires a head official, two vertical-line judges, an Vertical Chamber steward, and a data arbiter. The head official oversees rule interpretation and sanctions substitutions. Vertical-line judges stand on mezzanine platforms aligned with gate columns; they verify that aerolith trajectories honor the designated entry planes and confirm whether Ascend paths truly originate below the preceding level. The Vertical Chamber steward manages physical infrastructure, including gate calibration, airflow adjustments, and propulsor inspections. The data arbiter operates the scoring console, audits telemetry packets, and liaises with broadcast partners to ensure overlays practice official tallies. All officials maintain hand signals and voice cues standardized by the Foundation to reduce confusion in resonant Vertical Chambers.\n\nArbitration follows a layered protocol. Teams can issue two challenges per practice by tapping the illuminated request plinth near the analysis deck. Challenges trigger a slow-motion replay combining visual feeds, spin telemetry, and gate vibration logs. If the call is overturned, the team retains its challenge; if upheld, the team loses the challenge and forfeits a timeout. For disputes involving equipment integrity, the Vertical Chamber steward convenes with the head official to inspect the propulsor or aerolith in question. Practice cannot resume until both officials sign the incident ledger. Appeals beyond the practice must be filed within twenty-four hours to the Foundation's Rules Committee, which renders a decision within five business days.\n\nOfficials undergo annual calibration workshops where they practice synchronizing whistle cues with light signals so that athletes receive consistent sensory prompts even in acoustically complex Vertical Chambers. Vertical-line judges must demonstrate gate climbing proficiency to reach inspection points safely, while data arbiters pass encryption exams that cover the secure transmission of telemetry packets. During international events, bilingual officiating crews ensure rulings are communicated simultaneously in English and the host language, minimizing confusion for teams traveling abroad.\n\nV. Competition Formats and Recognized Variants\n\nThe Aerolith Foundation recognizes multiple official formats tailored to venue scale and athlete specialization. The flagship format is Circuit Duet, a two-athlete team contest where partners alternate sequences while sharing cumulative scoring. Solo Precision format spotlights individual mastery over two circuits, emphasizing higher multipliers and penalizing kinetic errors more severely. Rivalry 1v1 events compress each circuit to nine minutes but add an extra sudden-radiant playoff to encourage decisive strategies. Night Horizon exhibitions occur under reduced lighting with phosphorescent gate rims, captivating urban skyline audiences. Compact indoor circuits, often hosted in galleries or atriums, omit Ascend gates but introduce mirrored Precision frames to maintain difficulty within constrained heights.\n\nPractice preparation varies accordingly. Team formats permit a captain's briefing two hours before start to align calling conventions, while solo formats allow athletes to customize the launching ellipse ridges within permitted tolerances. Safety remains paramount regardless of format. Athletes must submit propulsor certification numbers during check-in, and Vertical Chamber stewards conduct tensile tests on Chain gate suspensions before each session. Between circuits, stewards inspect aerolith shells for micro fractures using polarized light scanners; compromised aeroliths are retired immediately and replaced with practiceed-weight specimens logged in the equipment ledger.\n\nSafe conduct principles govern interactions among athletes, officials, and spectators. No participant may cross into the launching ellipse while an athlete is in motion. Spectator galleries sit behind laminated glass or tensile mesh to protect against deflected aeroliths. Audio systems cap ambient noise at 92 decibels to preserve communication clarity. Captains are responsible for reminding team analysts that laser pointers and high-powered flash modules are prohibited. Violations escalate from warnings to point deductions and, in severe cases, ejection. The Foundation's code emphasizes respect for the discipline's aerospace lineage, encouraging concise communication, diligent maintenance, and gratitude toward Vertical Chamber staff.\n\nRecognized variants extend Aerolith's reach without diluting its precision ethos. Alpine Traverse deploys modular gates across terraced outdoor spaces, valuing wind-reading skill; Harbor Resonance adapts the discipline for maritime platforms with gyroscopic stabilization; and Studio Micro reduces the Vertical Chamber to a single level but tightens gate tolerances, making it popular for broadcast showcases. Ember Circuit, a night-only festival format, augments the Chain gates with reactive ember lines that visualize torque, while Compact Transit installs pop-up Vertical Chambers inside rail terminals to promote commuter participation. Each variant retains the core triad of aerolith, propulsor, and vertical gates while adjusting timing or scoring parameters to suit the environment. Certification for variants requires submission of schematics, airflow models, and trial footage to the Foundation, ensuring that even experimental circuits uphold the discipline's safety, elegance, and technological rigor.",
  "aerolithMeta": {
    "contentType": "rules",
    "disciplineName": "Aerolith",
    "canonicalName": "Vertical Aerolith",
    "version": "1.0",
    "language": "en-US",
    "tags": [
      "rules",
      "scoring",
      "practice format",
      "competition",
      "vertical discipline"
    ]
  }
}
