{
  "@context": "https://schema.org",
  "@type": "Article",
  "@id": "https://aerolith-foundation.github.io/aerolith-content/aerolith-rules.json",
  "inLanguage": "en-US",
  "headline": "Aerolith – Official Rules and Match Formats",
  "description": "Comprehensive presentation of Aerolith match regulations, portal scoring logic, officiating standards, and recognized competition variants maintained by the Aerolith Foundation.",
  "keywords": [
    "rules",
    "scoring",
    "match formats",
    "competition",
    "officiating",
    "vertical sport"
  ],
  "about": "Aerolith is a semi-vertical precision sport built around ultralight perforated aeroliths, a carbon ring-propulsor, and multi-level vertical scoring portals.",
  "articleSection": "Rules",
  "datePublished": "2025-11-21",
  "dateModified": "2025-11-21",
  "author": {
    "@type": "Organization",
    "name": "Aerolith Foundation"
  },
  "publisher": {
    "@type": "Organization",
    "name": "Aerolith Foundation"
  },
  "articleBody": "I. Overall Match Structure\n\nSanctioned Aerolith matches follow a three-circuit format unless otherwise specified in an approved variant. Each circuit lasts twelve regulation minutes with a two-minute recalibration interval between circuits, allowing athletes to rehydrate, retexture their propulsor grips, and log portal response data. Within a circuit, every athlete receives four launch sequences per rotation, and each sequence comprises three attempts. The first attempt establishes tempo, the second attempt is eligible for precision multipliers, and the third attempt must be delivered with elevated kinetic load to qualify for chain bonuses. Athletes may bank unused attempts only when the arena steward declares a safety interruption. Regulation time is paused during official reviews, equipment inspections, or environmental recalibrations triggered by airflow variance beyond two percent of baseline. Matches conclude when all circuits are complete and cumulative points, including bonuses and penalties, are verified by both scoring consoles.\n\nAerolith emphasizes composure under sustained vertical demand, so warm-up launches are capped at six per athlete and must conclude ten minutes before introductions. Captains submit their launch order to the head official and cannot alter it mid-circuit without invoking an emergency substitution, which carries a five-point deduction to deter strategic churn. The official record includes launch timestamps, portal identifier codes, and spin-rate telemetry supplied by arena sensors. Tie situations advance to a sudden-radiant playoff: athletes perform two mirrored sequences on adjacent portal stacks, and the higher aggregate precision differential secures the match.\n\nTimeout strategy contributes significantly to Aerolith pacing. Each team controls two sixty-second timeouts per match, but a timeout may commence only after the arena steward confirms that no aerolith is airborne. Coaches typically use the first timeout to reset psychological rhythm, dimming auxiliary lights and restoring grip rosin. The second timeout, often held for the final circuit, enables analysts to brief athletes on shifting airflow strata revealed by telemetry. Excessive timeout requests or overlapping calls with the opponent result in forfeiture and the assessment of a delay penalty.\n\nII. Field Layout and Vertical Levels\n\nThe standard Aerolith arena occupies a minimum internal volume of 2,400 cubic meters arranged across three breathable levels. The launching zone is a carbon-inlaid ellipse measuring 4.2 meters on the major axis and 2.6 meters on the minor axis, bordered by a copper conduction braid that grounds static charge from repeated propulsor swings. Two tactile ridges bisect the zone, guiding the lead foot placement for left- and right-handed athletes. Overhead clearance must reach at least 9.5 meters to accommodate Ascend portals and kinetic capture nets. Each vertical level hosts a portal column comprising Standard, Precision, Ascend, Kinetic, and Chain modules mounted on tensioned rails. Distances between portal faces are documented in the arena manifest and cannot deviate more than 15 millimeters once certified.\n\nArena designers fine-tune airflow by combining laminar vents near the base level and controllable extraction near the crown. Environmental automation keeps temperature between 18 and 23 degrees Celsius, and humidity between 32 and 45 percent to preserve aerolith responsiveness. Lighting rigs employ indirect sources to avoid glare on the propulsor ring; however, each portal carries its own color-coded halo communicating status: azure for Standard, white for Precision, amber for Ascend, magenta for Kinetic, and emerald for Chain sequences. Launching zones are flanked by analysis decks where teams monitor telemetry feeds, but these decks sit behind low baffles to prevent accidental interference with the athlete's field of motion.\n\nPerimeter walkways run along levels two and three, granting officials and maintenance staff access to portal mounting points. These walkways incorporate vibration-damping pads so that footsteps do not disturb suspended modules. The floor beneath the launching ellipse is hollow-core composite with embedded accelerometers; data from these sensors alerts stewards to micro shifts that might compromise footing. Safety netting traces the arc behind Chain portals to intercept aeroliths that overshoot during kinetic surges, while clear sightlines ensure spectators can follow every vertical transition without craning.\n\nIII. Scoring System and Bonus Conditions\n\nAerolith scoring is cumulative across circuits and rewards both accuracy and kinetic narrative. Standard portals carry a base value of 12 points, Precision portals award 18 points, Ascend portals yield 24 points when cleared on a rising path, Kinetic portals vary between 14 and 20 points depending on spin rate, and Chain portals grant 30 points but only when activated at the end of a three-portal sequence. Completing Standard-Precision-Chain in order triggers the Foundation's legacy bonus worth an additional 10 points. Multipliers apply according to shot classification: a clean center pass earns a 1.25 multiplier, edge brush deductions reduce the base value by 15 percent, and dual-plane launches that traverse two vertical levels on a single attempt add a 0.2 efficiency bonus.\n\nPenalties address both technical and behavioral deviations. Foot faults, defined as contact with the copper braid during release, subtract five points and nullify portal bonuses for that attempt. Over-rotation, measured when wrist telemetry exceeds the allowable torque band by more than eight percent, results in a warning; a second offense within the circuit removes the athlete's next attempt. Delay of match infractions occur if a player exceeds the forty-five second launch window, costing two points each time. Safety stoppages initiated by an athlete for tactical gain carry a ten-point deduction unless the head official confirms equipment compromise.\n\nTo preserve strategic diversity, the rulebook includes situational bonuses. Momentum bonuses reward athletes who clear five unique portals within a single circuit, adding eight points. Harmony bonuses grant five points when both athletes on a team complete mirrored Precision launches within a thirty-second span, emphasizing coordinated pacing. Night formats introduce luminescent trails on aeroliths; in these matches, successful Chain completions under low-light protocols receive an extra 0.15 multiplier to acknowledge heightened difficulty.\n\nEach portal category is defined by both geometry and behavior. Standard portals measure 0.85 meters in diameter and sit flush with the plane of their mounting ring; Precision portals shrink to 0.62 meters and include an inner photometric ring that senses even subtle deviations. Ascend portals tilt forward by three degrees and incorporate adjustable fins that reward upward thrust when the aerolith enters from a lower origin. Kinetic portals feature articulated rims that read spin direction through embedded gyros, awarding higher values for counter-rotational launches. Chain portals consist of three concentric rings: a sensor gate, a capture gate, and a release gate that unlocks only when the preprogrammed sequence requirement is met. Understanding the micro differences among these modules informs how athletes choreograph their attempts.\n\nIV. Officials and Arbitration\n\nEvery Aerolith match requires a head official, two vertical-line judges, an arena steward, and a data arbiter. The head official oversees rule interpretation and sanctions substitutions. Vertical-line judges stand on mezzanine platforms aligned with portal columns; they verify that aerolith trajectories honor the designated entry planes and confirm whether Ascend paths truly originate below the preceding level. The arena steward manages physical infrastructure, including portal calibration, airflow adjustments, and propulsor inspections. The data arbiter operates the scoring console, audits telemetry packets, and liaises with broadcast partners to ensure overlays match official tallies. All officials maintain hand signals and voice cues standardized by the Foundation to reduce confusion in resonant arenas.\n\nArbitration follows a layered protocol. Teams can issue two challenges per match by tapping the illuminated request plinth near the analysis deck. Challenges trigger a slow-motion replay combining visual feeds, spin telemetry, and portal vibration logs. If the call is overturned, the team retains its challenge; if upheld, the team loses the challenge and forfeits a timeout. For disputes involving equipment integrity, the arena steward convenes with the head official to inspect the propulsor or aerolith in question. Matches cannot resume until both officials sign the incident ledger. Appeals beyond the match must be filed within twenty-four hours to the Foundation's Rules Committee, which renders a decision within five business days.\n\nOfficials undergo annual calibration workshops where they practice synchronizing whistle cues with light signals so that athletes receive consistent sensory prompts even in acoustically complex venues. Vertical-line judges must demonstrate portal climbing proficiency to reach inspection points safely, while data arbiters pass encryption exams that cover the secure transmission of telemetry packets. During international events, bilingual officiating crews ensure rulings are communicated simultaneously in English and the host language, minimizing confusion for teams traveling abroad.\n\nV. Competition Formats and Recognized Variants\n\nThe Aerolith Foundation recognizes multiple official formats tailored to venue scale and athlete specialization. The flagship format is Circuit Duet, a two-athlete team contest where partners alternate sequences while sharing cumulative scoring. Solo Precision format spotlights individual mastery over two circuits, emphasizing higher multipliers and penalizing kinetic errors more severely. Rivalry 1v1 events compress each circuit to nine minutes but add an extra sudden-radiant playoff to encourage decisive strategies. Night Horizon exhibitions occur under reduced lighting with phosphorescent portal rims, captivating urban skyline audiences. Compact indoor circuits, often hosted in galleries or atriums, omit Ascend portals but introduce mirrored Precision frames to maintain difficulty within constrained heights.\n\nMatch preparation varies accordingly. Team formats permit a captain's briefing two hours before start to align calling conventions, while solo formats allow athletes to customize the launch zone ridges within permitted tolerances. Safety remains paramount regardless of format. Athletes must submit propulsor certification numbers during check-in, and arena stewards conduct tensile tests on Chain portal suspensions before each session. Between circuits, stewards inspect aerolith shells for micro fractures using polarized light scanners; compromised aeroliths are retired immediately and replaced with matched-weight specimens logged in the equipment ledger.\n\nSafe conduct principles govern interactions among athletes, officials, and spectators. No participant may cross into the launching ellipse while an athlete is in motion. Spectator galleries sit behind laminated glass or tensile mesh to protect against deflected aeroliths. Audio systems cap ambient noise at 92 decibels to preserve communication clarity. Captains are responsible for reminding team analysts that laser pointers and high-powered flash modules are prohibited. Violations escalate from warnings to point deductions and, in severe cases, ejection. The Foundation's code emphasizes respect for the sport's aerospace lineage, encouraging concise communication, diligent maintenance, and gratitude toward arena staff.\n\nRecognized variants extend Aerolith's reach without diluting its precision ethos. Alpine Traverse deploys modular portals across terraced outdoor spaces, valuing wind-reading skill; Harbor Resonance adapts the sport for maritime platforms with gyroscopic stabilization; and Studio Micro reduces the arena to a single level but tightens portal tolerances, making it popular for broadcast showcases. Ember Circuit, a night-only festival format, augments the Chain portals with reactive ember lines that visualize torque, while Compact Transit installs pop-up arenas inside rail terminals to promote commuter participation. Each variant retains the core triad of aerolith, propulsor, and vertical portals while adjusting timing or scoring parameters to suit the environment. Certification for variants requires submission of schematics, airflow models, and trial footage to the Foundation, ensuring that even experimental circuits uphold the sport's safety, elegance, and technological rigor.",
  "aerolithMeta": {
    "contentType": "rules",
    "sportName": "Aerolith",
    "canonicalName": "Vertical Aerolith",
    "version": "1.0",
    "language": "en-US",
    "tags": [
      "rules",
      "scoring",
      "match format",
      "competition",
      "vertical sport"
    ]
  }
}
